Tekla Open API Reference for Tekla Structures 2025
ViewMarkTagAttributes Constructor
Overload List
Name | Description
View.ViewMarkTagAttributes()
 Creates a new mark tag attributes instance.
View.ViewMarkTagAttributes(Vector, TagLocation, TextAlignment, ContainerElement)
 Creates a new mark tag attributes instance with the given offset, location, alignment and content.
Top
See Also
Reference
View.ViewMarkTagAttributes Class
Tekla.Structures.Drawing Namespace